In [1]:
print("hello")

hello

In [3]:
# Identify the Python interpreter being used or environment
import sys
import os

# Print Python executable path and version
print(f"Python executable: {sys.executable}")
print(f"Python version: {sys.version}")

# Check if running in a Conda environment
is_conda = os.path.exists(os.path.join(os.path.dirname(sys.executable), 'conda-meta'))
print(f"Is Conda environment: {is_conda}")

# Get environment name if it's Conda
if is_conda:
    # Get the environment name from path or env vars
    if 'CONDA_DEFAULT_ENV' in os.environ:
        print(f"Conda environment: {os.environ['CONDA_DEFAULT_ENV']}")
    else:
        # Try to extract from path
        env_path = os.path.dirname(os.path.dirname(sys.executable))
        env_name = os.path.basename(env_path)
        print(f"Conda environment path: {env_path}")
        print(f"Conda environment name: {env_name}")

Python executable: c:\Users\DevarshShukla\source\repos\Devarsh\python\pythonlearning\myenv\python.exe
Python version: 3.12.9 | packaged by conda-forge | (main, Mar  4 2025, 22:37:18) [MSC v.1943 64 bit (AMD64)]
Is Conda environment: True
Conda environment: C:\Users\DevarshShukla\source\repos\Devarsh\python\pythonlearning\myenv

Install pandas using conda from this notebook
!conda install pandas

# key data structures in pandas
* series
* dataframe

In [4]:
import  pandas as pd

In [7]:
series = pd.Series([1,2,3,4,5])
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
series_with_index = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
print(series_with_index)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
series_with_index

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
# Create DataFrame with sample data
dataframe = pd.DataFrame({
    "names": ["Alice", "Bob", "Charlie"],
    "marks": [85, 90, 75]
})

In [13]:
dataframe

     names  marks
0    Alice     85
1      Bob     90
2  Charlie     75

In [16]:
df_sp500 = pd.read_csv("data/SP500.csv")

In [17]:
df_sp500

     observation_date    SP500
0          2015-01-30  1994.99
1          2015-02-02  2020.85
2          2015-02-03  2050.03
3          2015-02-04  2041.51
4          2015-02-05  2062.52
...               ...      ...
2615       2025-02-07  6025.99
2616       2025-02-10  6066.44
2617       2025-02-11  6068.50
2618       2025-02-12  6051.97
2619       2025-02-13  6115.07

[2620 rows x 2 columns]

In [18]:
# Display the first few rows of the DataFrame
df_sp500.head()

  observation_date    SP500
0       2015-01-30  1994.99
1       2015-02-02  2020.85
2       2015-02-03  2050.03
3       2015-02-04  2041.51
4       2015-02-05  2062.52

In [19]:
# Display the last few rows of the DataFrame
df_sp500.tail()

     observation_date    SP500
2615       2025-02-07  6025.99
2616       2025-02-10  6066.44
2617       2025-02-11  6068.50
2618       2025-02-12  6051.97
2619       2025-02-13  6115.07

In [20]:
# Display the shape of the DataFrame or provides information of full dataset
df_sp500.describe()

             SP500
count  2526.000000
mean   3396.494109
std    1111.703653
min    1829.080000
25%    2444.755000
50%    3045.540000
75%    4247.620000
max    6118.710000

In [21]:
df_sp500.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2620 entries, 0 to 2619
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   observation_date  2620 non-null   object
 1   SP500             2526 non-null   float64
dtypes: float64(1), object(1)
memory usage: 41.1+ KB

# Data selection

In [24]:
df_sp500["observation_date"]

0       2015-01-30
1       2015-02-02
2       2015-02-03
3       2015-02-04
4       2015-02-05
           ...
2615    2025-02-07
2616    2025-02-10
2617    2025-02-11
2618    2025-02-12
2619    2025-02-13
Name: observation_date, Length: 2620, dtype: object

In [28]:
type(df_sp500)

pandas.core.frame.DataFrame

In [29]:
type(df_sp500["observation_date"])

pandas.core.series.Series

In [30]:
df_sp500.iloc[0]

observation_date    2015-01-30
SP500                  1994.99
Name: 0, dtype: object

In [31]:
df_sp500.iloc[-1]

observation_date    2025-02-13
SP500                  6115.07
Name: 2619, dtype: object

In [32]:
# Get all rows where SP500 is NaN
nan_rows = df_sp500[df_sp500['SP500'].isnull()]

# Display the result
print(f"Number of rows with missing SP500 values: {len(nan_rows)}")
nan_rows.head()  # Show first 5 rows with NaN values

Number of rows with missing SP500 values: 94

    observation_date  SP500
11        2015-02-16    NaN
45        2015-04-03    NaN
81        2015-05-25    NaN
110       2015-07-03    NaN
156       2015-09-07    NaN